# **DataFrame**

- Combination of series

In [32]:
import pandas as pd
import numpy as np

In [33]:
data = {
    "Name" : ["Tejas", "Akash", "Suraj"],
    "Age" : [24, 23, 25],
    "City" : ["Nagpur", "Pune", "Akola"],
    "Salary" : [170000, 130000, 120000]
}

df = pd.DataFrame(data)
df

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [34]:
data_list = [
    ["Tejas", 24, "Nagpur", 170000],
    ["Akash", 23, "Pune", 130000],
    ["Suraj", 25, "Akola", 120000]
]
df1 = pd.DataFrame(data_list)
columns = ["Name", "Age", "City", "Salary"]
df1 = pd.DataFrame(data_list, columns=columns)
df1

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

- Selection and Indexing of Columns

In [35]:
df1

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [36]:
df1[["Name", "City"]]

    Name    City
0  Tejas  Nagpur
1  Akash    Pune
2  Suraj   Akola

- Creating New Column

In [38]:
df1["Designation"] = ["Data Engineer", "SD Engineer", "Ml Engineer"]
df1

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    Ml Engineer

- Removing Columns

In [40]:
df1.drop(0, axis=0)

    Name  Age   City  Salary  Designation
1  Akash   23   Pune  130000  SD Engineer
2  Suraj   25  Akola  120000  Ml Engineer

In [41]:
df1

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    Ml Engineer

In [43]:
df1.drop("Designation", axis= 1)

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [44]:
df1.drop(0, axis=0)

    Name  Age   City  Salary  Designation
1  Akash   23   Pune  130000  SD Engineer
2  Suraj   25  Akola  120000  Ml Engineer

- Selecting Rows

In [46]:
df1

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    Ml Engineer

In [47]:
df1.loc[0]

Name                   Tejas
Age                       24
City                  Nagpur
Salary                170000
Designation    Data Engineer
Name: 0, dtype: object

In [50]:
df1.loc[[0,1]]

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer

In [52]:
df1.iloc[1]

Name                 Akash
Age                     23
City                  Pune
Salary              130000
Designation    SD Engineer
Name: 1, dtype: object

- Selecting Subsets of Rows and Columns

In [53]:
df1.loc[[0,1],["Name","Designation"]]

    Name    Designation
0  Tejas  Data Engineer
1  Akash    SD Engineer

- Conditional Selection

In [54]:
df1

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    Ml Engineer

In [56]:
df1[df1["Age"]> 23]

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
2  Suraj   25   Akola  120000    Ml Engineer

In [60]:
df1[(df1["Age"]> 23) & (df1["City"] == "Nagpur")]

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer

- Data Preprocessing

In [70]:
df1

    Name  Age    City  Salary    Designation
0  Tejas   24  Nagpur  170000  Data Engineer
1  Akash   23    Pune  130000    SD Engineer
2  Suraj   25   Akola  120000    Ml Engineer

In [68]:
df1.describe()

        Age         Salary
count   3.0       3.000000
mean   24.0  140000.000000
std     1.0   26457.513111
min    23.0  120000.000000
25%    23.5  125000.000000
50%    24.0  130000.000000
75%    24.5  150000.000000
max    25.0  170000.000000

In [69]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         3 non-null      object
 1   Age          3 non-null      int64
 2   City         3 non-null      object
 3   Salary       3 non-null      int64
 4   Designation  3 non-null      object
dtypes: int64(2), object(3)
memory usage: 252.0+ bytes